Revit.Elements.RevisionCloud
Revit Revision Cloud

Revit.Elements.RevisionCloud.InternalRevitElement
Internal reference to the Revit Element

Revit.Elements.RevisionCloud.InternalElement
Reference to the Element

Revit.Elements.RevisionCloud.#ctor(Autodesk.Revit.DB.RevisionCloud)
Create revision cloud from revit element
RevisionCloud:

Revit.Elements.RevisionCloud.#ctor(Autodesk.Revit.DB.View,System.Collections.Generic.List{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.ElementId)
Create Revision cloud from view
view:
curves:
id:

Revit.Elements.RevisionCloud.InternalSetElement(Autodesk.Revit.DB.RevisionCloud)
Set the internal Element, ElementId, and UniqueId
wall:

Revit.Elements.RevisionCloud.Init(Autodesk.Revit.DB.View,System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.ElementId)
Create new RevisionCloud from Curves
view:
curves:
id:

Revit.Elements.RevisionCloud.ByCurve(Revit.Elements.Views.View,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Revit.Elements.Element)
Construct a Revit RevisionCloud element by curves
view: View to place element on
curves: Cloud outline
revision: Revit revision
Returns:

Revit.Elements.RevisionCloud.Revision
Get Revision cloud's revision

Revit.Elements.RevisionCloud.Curves
Get Revision cloud's curves

Revit.Elements.RevisionCloud.FromExisting(Autodesk.Revit.DB.RevisionCloud,System.Boolean)
Create RevisionCloud from existing reference
revisionCloud:
isRevitOwned:
Returns: